; ModuleID = 'mpi-pow.c'
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.gcry_mpi = type { i32, i32, i32, i32, i64* }
%struct.karatsuba_ctx = type { %struct.karatsuba_ctx*, i64*, i32, i32, i64*, i32, i32 }

@.str = private unnamed_addr constant [11 x i8] c"!bp_marker\00", align 1
@.str1 = private unnamed_addr constant [10 x i8] c"mpi-pow.c\00", align 1
@__FUNCTION__._gcry_mpi_powm = private unnamed_addr constant [15 x i8] c"_gcry_mpi_powm\00", align 1
@.str2 = private unnamed_addr constant [13 x i8] c"res->d == rp\00", align 1

; Function Attrs: nounwind uwtable
define void @_gcry_mpi_powm(%struct.gcry_mpi* %res, %struct.gcry_mpi* %base, %struct.gcry_mpi* %expo, %struct.gcry_mpi* %mod) #0 {
entry:
  %res.addr = alloca %struct.gcry_mpi*, align 8
  %base.addr = alloca %struct.gcry_mpi*, align 8
  %expo.addr = alloca %struct.gcry_mpi*, align 8
  %mod.addr = alloca %struct.gcry_mpi*, align 8
  %rp = alloca i64*, align 8
  %ep = alloca i64*, align 8
  %mp = alloca i64*, align 8
  %bp = alloca i64*, align 8
  %esize = alloca i32, align 4
  %msize = alloca i32, align 4
  %bsize = alloca i32, align 4
  %rsize = alloca i32, align 4
  %msign = alloca i32, align 4
  %bsign = alloca i32, align 4
  %rsign = alloca i32, align 4
  %esec = alloca i32, align 4
  %msec = alloca i32, align 4
  %bsec = alloca i32, align 4
  %size = alloca i32, align 4
  %mod_shift_cnt = alloca i32, align 4
  %negative_result = alloca i32, align 4

!0 = !MDCompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (trunk) (https://git.psu.edu/dbz5017/LLVM-Deps.git 9a6ab583de97608754c2961079257073e80a0028)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !9, globals: !2, imports: !2)
!1 = !MDFile(filename: "mpi-pow.c", directory: "/home/adam/research/LLVM-Deps/projects/llvm-deps/mod_exp_tests/libgcrypt1.7.6/mpi")
!2 = !{}
!3 = !{!4, !7}
!4 = !MDDerivedType(tag: DW_TAG_typedef, name: "UDItype", file: !5, line: 267, baseType: !6)
!5 = !MDFile(filename: "./mpi-internal.h", directory: "/home/adam/research/LLVM-Deps/projects/llvm-deps/mod_exp_tests/libgcrypt1.7.6/mpi")
!6 = !MDBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!7 = !MDDerivedType(tag: DW_TAG_typedef, name: "mpi_size_t", file: !5, line: 72, baseType: !8)
!8 = !MDBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !{!10, !27}
!10 = !MDSubprogram(name: "_gcry_mpi_powm", scope: !1, file: !1, line: 399, type: !11, isLocal: false, isDefinition: true, scopeLine: 401, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.gcry_mpi*, %struct.gcry_mpi*, %struct.gcry_mpi*, %struct.gcry_mpi*)* @_gcry_mpi_powm, variables: !2)
!11 = !MDSubroutineType(types: !12)
!12 = !{null, !13, !13, !13, !13}
!13 = !MDDerivedType(tag: DW_TAG_typedef, name: "gcry_mpi_t", file: !14, line: 236, baseType: !15)
!14 = !MDFile(filename: "../include/gcrypt.h", directory: "/home/adam/research/LLVM-Deps/projects/llvm-deps/mod_exp_tests/libgcrypt1.7.6/mpi")
!15 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !MDCompositeType(tag: DW_TAG_structure_type, name: "gcry_mpi", file: !17, line: 65, size: 192, align: 64, elements: !18)
!17 = !MDFile(filename: "../include/mpi.h", directory: "/home/adam/research/LLVM-Deps/projects/llvm-deps/mod_exp_tests/libgcrypt1.7.6/mpi")
!18 = !{!19, !20, !21, !22, !24}
!19 = !MDDerivedType(tag: DW_TAG_member, name: "alloced", scope: !16, file: !17, line: 67, baseType: !8, size: 32, align: 32)
!20 = !MDDerivedType(tag: DW_TAG_member, name: "nlimbs", scope: !16, file: !17, line: 68, baseType: !8, size: 32, align: 32, offset: 32)
!21 = !MDDerivedType(tag: DW_TAG_member, name: "sign", scope: !16, file: !17, line: 69, baseType: !8, size: 32, align: 32, offset: 64)
!22 = !MDDerivedType(tag: DW_TAG_member, name: "flags", scope: !16, file: !17, line: 71, baseType: !23, size: 32, align: 32, offset: 96)
!23 = !MDBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!24 = !MDDerivedType(tag: DW_TAG_member, name: "d", scope: !16, file: !17, line: 75, baseType: !25, size: 64, align: 64, offset: 128)
!25 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !MDDerivedType(tag: DW_TAG_typedef, name: "mpi_limb_t", file: !5, line: 38, baseType: !6)
!27 = !MDSubprogram(name: "mul_mod", scope: !1, file: !1, line: 365, type: !28, isLocal: true, isDefinition: true, scopeLine: 370, flags: DIFlagPrototyped, isOptimized: false, function: void (i64*, i32*, i64*, i32, i64*, i32, i64*, i32, %struct.karatsuba_ctx*)* @mul_mod, variables: !2)
!28 = !MDSubroutineType(types: !29)
!29 = !{null, !30, !31, !30, !7, !30, !7, !30, !7, !32}
!30 = !MDDerivedType(tag: DW_TAG_typedef, name: "mpi_ptr_t", file: !5, line: 71, baseType: !25)
!31 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!32 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !MDCompositeType(tag: DW_TAG_structure_type, name: "karatsuba_ctx", file: !5, line: 207, size: 320, align: 64, elements: !34)
!34 = !{!35, !36, !37, !38, !39, !40, !41}
!35 = !MDDerivedType(tag: DW_TAG_member, name: "next", scope: !33, file: !5, line: 208, baseType: !32, size: 64, align: 64)
!36 = !MDDerivedType(tag: DW_TAG_member, name: "tspace", scope: !33, file: !5, line: 209, baseType: !30, size: 64, align: 64, offset: 64)
!37 = !MDDerivedType(tag: DW_TAG_member, name: "tspace_nlimbs", scope: !33, file: !5, line: 210, baseType: !23, size: 32, align: 32, offset: 128)
!38 = !MDDerivedType(tag: DW_TAG_member, name: "tspace_size", scope: !33, file: !5, line: 211, baseType: !7, size: 32, align: 32, offset: 160)
!39 = !MDDerivedType(tag: DW_TAG_member, name: "tp", scope: !33, file: !5, line: 212, baseType: !30, size: 64, align: 64, offset: 192)
!40 = !MDDerivedType(tag: DW_TAG_member, name: "tp_nlimbs", scope: !33, file: !5, line: 213, baseType: !23, size: 32, align: 32, offset: 256)
!41 = !MDDerivedType(tag: DW_TAG_member, name: "tp_size", scope: !33, file: !5, line: 214, baseType: !7, size: 32, align: 32, offset: 288)
!42 = !{i32 2, !"Dwarf Version", i32 4}
!43 = !{i32 2, !"Debug Info Version", i32 3}
!44 = !{!"clang version 3.7.0 (trunk) (https://git.psu.edu/dbz5017/LLVM-Deps.git 9a6ab583de97608754c2961079257073e80a0028)"}
!45 = !MDLocalVariable(tag: DW_TAG_arg_variable, name: "res", arg: 1, scope: !10, file: !1, line: 399, type: !13)
!46 = !MDExpression()
!47 = !MDLocation(line: 399, column: 28, scope: !10)
!48 = !MDLocalVariable(tag: DW_TAG_arg_variable, name: "base", arg: 2, scope: !10, file: !1, line: 400, type: !13)
!49 = !MDLocation(line: 400, column: 28, scope: !10)
!50 = !MDLocalVariable(tag: DW_TAG_arg_variable, name: "expo", arg: 3, scope: !10, file: !1, line: 400, type: !13)
!51 = !MDLocation(line: 400, column: 45, scope: !10)
!52 = !MDLocalVariable(tag: DW_TAG_arg_variable, name: "mod", arg: 4, scope: !10, file: !1, line: 400, type: !13)
!53 = !MDLocation(line: 400, column: 62, scope: !10)
!54 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "rp", scope: !10, file: !1, line: 403, type: !30)
!55 = !MDLocation(line: 403, column: 14, scope: !10)
!56 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "ep", scope: !10, file: !1, line: 403, type: !30)
!57 = !MDLocation(line: 403, column: 18, scope: !10)
!58 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "mp", scope: !10, file: !1, line: 403, type: !30)
!59 = !MDLocation(line: 403, column: 22, scope: !10)
!60 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "bp", scope: !10, file: !1, line: 403, type: !30)
!61 = !MDLocation(line: 403, column: 26, scope: !10)
!62 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "esize", scope: !10, file: !1, line: 404, type: !7)
!63 = !MDLocation(line: 404, column: 14, scope: !10)
!64 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "msize", scope: !10, file: !1, line: 404, type: !7)
!65 = !MDLocation(line: 404, column: 21, scope: !10)
!66 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "bsize", scope: !10, file: !1, line: 404, type: !7)
!67 = !MDLocation(line: 404, column: 28, scope: !10)
!68 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "rsize", scope: !10, file: !1, line: 404, type: !7)
!69 = !MDLocation(line: 404, column: 35, scope: !10)
!70 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "msign", scope: !10, file: !1, line: 405, type: !8)
!71 = !MDLocation(line: 405, column: 21, scope: !10)
!72 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "bsign", scope: !10, file: !1, line: 405, type: !8)
!73 = !MDLocation(line: 405, column: 28, scope: !10)
!74 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "rsign", scope: !10, file: !1, line: 405, type: !8)
!75 = !MDLocation(line: 405, column: 35, scope: !10)
!76 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "esec", scope: !10, file: !1, line: 407, type: !8)
!77 = !MDLocation(line: 407, column: 14, scope: !10)
!78 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "msec", scope: !10, file: !1, line: 407, type: !8)
!79 = !MDLocation(line: 407, column: 21, scope: !10)
!80 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "bsec", scope: !10, file: !1, line: 407, type: !8)
!81 = !MDLocation(line: 407, column: 28, scope: !10)
!82 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !10, file: !1, line: 409, type: !7)
!83 = !MDLocation(line: 409, column: 14, scope: !10)
!84 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "mod_shift_cnt", scope: !10, file: !1, line: 411, type: !8)
!85 = !MDLocation(line: 411, column: 7, scope: !10)
!86 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "negative_result", scope: !10, file: !1, line: 412, type: !8)
!87 = !MDLocation(line: 412, column: 7, scope: !10)
!88 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "mp_marker", scope: !10, file: !1, line: 413, type: !30)
!89 = !MDLocation(line: 413, column: 13, scope: !10)
