; ModuleID = '<stdin>'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct.mbedtls_mpi = type { i32, i64, i64* }
%struct.__sFILE = type { i8*, i32, i32, i16, i16, %struct.__sbuf, i32, i8*, i32 (i8*)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i32 (i8*, i8*, i32)*, %struct.__sbuf, %struct.__sFILEX*, i32, [3 x i8], [1 x i8], %struct.__sbuf, i32, i64 }
%struct.__sFILEX = type opaque
%struct.__sbuf = type { i8*, i32 }

@dummy = global i32 0, align 4
@.str = private unnamed_addr constant [2 x i8] c" \00", align 1
@.str1 = private unnamed_addr constant [17 x i8] c"0123456789ABCDEF\00", align 1
@.str2 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str3 = private unnamed_addr constant [5 x i8] c"%s%s\00", align 1
@.str4 = private unnamed_addr constant [129 x i8] c"EFE021C2645FD1DC586E69184AF4A31ED5F53E93B5F123FA41680867BA110131944FE7952E2517337780CB0DB80E61AAE7C8DDC6C5C6AADEB34EB38A2F40D5E6\00", align 1
@.str5 = private unnamed_addr constant [129 x i8] c"B2E7EFD37075B9F03FF989C7C5051C2034D2A323810251127E7BF8625A4F49A5F3E27F4DA8BD59C47D6DAABA4C8127BD5B5C25763222FEFCCFC38B832366C29E\00", align 1
@.str6 = private unnamed_addr constant [97 x i8] c"0066A198186C18C10B2F5ED9B522752A9830B69916E535C8F047518A889A43A594B6BED27A168D31D4A52F88925AA8F5\00", align 1

!0 = !MDCompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (trunk) (git@git.psu.edu:dbz5017/LLVM-Deps.git dfce73fe0831457cbc5c1a8f7788dfcbd809ad99)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !19, globals: !249, imports: !2)
!1 = !MDFile(filename: "./bign2/v3_bign2.c", directory: "/Users/ernestdefoy/Code/Research-2019/LLVM-Deps/projects/llvm-deps/mod_exp_tests/ct-verif-files/mbedtls2.9.0")
!2 = !{}
!3 = !{!4, !5, !11, !6, !12, !15, !16, !18}
!4 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64, align: 64)
!6 = !MDDerivedType(tag: DW_TAG_typedef, name: "mbedtls_mpi_uint", file: !7, line: 126, baseType: !8)
!7 = !MDFile(filename: "./bign2/v4_lib/bignum.h", directory: "/Users/ernestdefoy/Code/Research-2019/LLVM-Deps/projects/llvm-deps/mod_exp_tests/ct-verif-files/mbedtls2.9.0")
!8 = !MDDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !9, line: 31, baseType: !10)
!9 = !MDFile(filename: "/usr/include/_types/_uint64_t.h", directory: "/Users/ernestdefoy/Code/Research-2019/LLVM-Deps/projects/llvm-deps/mod_exp_tests/ct-verif-files/mbedtls2.9.0")
!10 = !MDBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!11 = !MDBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!12 = !MDDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !13, line: 62, baseType: !14)
!13 = !MDFile(filename: "/Users/ernestdefoy/Code/Research-2019/LLVM-Deps/Debug+Asserts/bin/../lib/clang/3.7.0/include/stddef.h", directory: "/Users/ernestdefoy/Code/Research-2019/LLVM-Deps/projects/llvm-deps/mod_exp_tests/ct-verif-files/mbedtls2.9.0")
!14 = !MDBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!15 = !MDBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!16 = !MDDerivedType(tag: DW_TAG_typedef, name: "mbedtls_t_udbl", file: !7, line: 127, baseType: !17)
!17 = !MDBasicType(name: "unsigned __int128", size: 128, align: 128, encoding: DW_ATE_unsigned)
!18 = !MDBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!19 = !{!20, !30, !31, !34, !37, !42, !45, !48, !51, !58, !61, !64, !67, !70, !71, !76, !81, !140, !143, !148, !151, !152, !153, !156, !157, !160, !163, !164, !165, !166, !169, !170, !171, !174, !177, !180, !183, !186, !189, !190, !196, !197, !200, !203, !206, !209, !210, !213, !216, !220, !223, !227, !230, !233, !236, !239, !242, !245, !248}
!20 = !MDSubprogram(name: "mbedtls_mpi_init", scope: !1, file: !1, line: 82, type: !21, isLocal: false, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.mbedtls_mpi*)* @mbedtls_mpi_init, variables: !2)
!21 = !MDSubroutineType(types: !22)
!22 = !{null, !23}
!23 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !MDDerivedType(tag: DW_TAG_typedef, name: "mbedtls_mpi", file: !7, line: 151, baseType: !25)
!25 = !MDCompositeType(tag: DW_TAG_structure_type, file: !7, line: 145, size: 192, align: 64, elements: !26)
!26 = !{!27, !28, !29}
!27 = !MDDerivedType(tag: DW_TAG_member, name: "s", scope: !25, file: !7, line: 147, baseType: !18, size: 32, align: 32)
!28 = !MDDerivedType(tag: DW_TAG_member, name: "n", scope: !25, file: !7, line: 148, baseType: !12, size: 64, align: 64, offset: 64)
!29 = !MDDerivedType(tag: DW_TAG_member, name: "p", scope: !25, file: !7, line: 149, baseType: !5, size: 64, align: 64, offset: 128)
!30 = !MDSubprogram(name: "mbedtls_mpi_free", scope: !1, file: !1, line: 95, type: !21, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.mbedtls_mpi*)* @mbedtls_mpi_free, variables: !2)
!31 = !MDSubprogram(name: "mbedtls_mpi_grow_0", scope: !1, file: !1, line: 114, type: !32, isLocal: false, isDefinition: true, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.mbedtls_mpi*, i64, i32, i64*)* @mbedtls_mpi_grow_0, variables: !2)
!32 = !MDSubroutineType(types: !33)
!33 = !{!18, !23, !12, !18, !5}
!34 = !MDSubprogram(name: "mbedtls_mpi_shrink", scope: !1, file: !1, line: 144, type: !35, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.mbedtls_mpi*, i64)* @mbedtls_mpi_shrink, variables: !2)
!35 = !MDSubroutineType(types: !36)
!36 = !{!18, !23, !12}
!37 = !MDSubprogram(name: "mbedtls_mpi_copy_0", scope: !1, file: !1, line: 180, type: !38, isLocal: false, isDefinition: true, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.mbedtls_mpi*, %struct.mbedtls_mpi*, i32, i64*)* @mbedtls_mpi_copy_0, variables: !2)
!38 = !MDSubroutineType(types: !39)
!39 = !{!18, !23, !40, !18, !5}
!40 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !MDDerivedType(tag: DW_TAG_const_type, baseType: !24)
!42 = !MDSubprogram(name: "mbedtls_mpi_swap", scope: !1, file: !1, line: 214, type: !43, isLocal: false, isDefinition: true, scopeLine: 215, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.mbedtls_mpi*, %struct.mbedtls_mpi*)* @mbedtls_mpi_swap, variables: !2)
!43 = !MDSubroutineType(types: !44)
!44 = !{null, !23, !23}
!45 = !MDSubprogram(name: "mbedtls_mpi_safe_cond_assign", scope: !1, file: !1, line: 228, type: !46, isLocal: false, isDefinition: true, scopeLine: 229, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.mbedtls_mpi*, %struct.mbedtls_mpi*, i8)* @mbedtls_mpi_safe_cond_assign, variables: !2)
!46 = !MDSubroutineType(types: !47)
!47 = !{!18, !23, !40, !11}
!48 = !MDSubprogram(name: "mbedtls_mpi_safe_cond_swap", scope: !1, file: !1, line: 256, type: !49, isLocal: false, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.mbedtls_mpi*, %struct.mbedtls_mpi*, i8)* @mbedtls_mpi_safe_cond_swap, variables: !2)
!49 = !MDSubroutineType(types: !50)
!50 = !{!18, !23, !23, !11}
!51 = !MDSubprogram(name: "mbedtls_mpi_lset_0", scope: !1, file: !1, line: 290, type: !52, isLocal: false, isDefinition: true, scopeLine: 291, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.mbedtls_mpi*, i64, i32, i64*)* @mbedtls_mpi_lset_0, variables: !2)
!52 = !MDSubroutineType(types: !53)
!53 = !{!18, !23, !54, !18, !5}
!54 = !MDDerivedType(tag: DW_TAG_typedef, name: "mbedtls_mpi_sint", file: !7, line: 125, baseType: !55)
!55 = !MDDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !56, line: 30, baseType: !57)
!56 = !MDFile(filename: "/usr/include/sys/_types/_int64_t.h", directory: "/Users/ernestdefoy/Code/Research-2019/LLVM-Deps/projects/llvm-deps/mod_exp_tests/ct-verif-files/mbedtls2.9.0")
!57 = !MDBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!58 = !MDSubprogram(name: "mbedtls_mpi_get_bit", scope: !1, file: !1, line: 308, type: !59, isLocal: false, isDefinition: true, scopeLine: 309, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.mbedtls_mpi*, i64)* @mbedtls_mpi_get_bit, variables: !2)
!59 = !MDSubroutineType(types: !60)
!60 = !{!18, !40, !12}
!61 = !MDSubprogram(name: "mbedtls_mpi_set_bit", scope: !1, file: !1, line: 319, type: !62, isLocal: false, isDefinition: true, scopeLine: 320, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.mbedtls_mpi*, i64, i8)* @mbedtls_mpi_set_bit, variables: !2)
!62 = !MDSubroutineType(types: !63)
!63 = !{!18, !23, !12, !11}
!64 = !MDSubprogram(name: "mbedtls_mpi_lsb", scope: !1, file: !1, line: 347, type: !65, isLocal: false, isDefinition: true, scopeLine: 348, flags: DIFlagPrototyped, isOptimized: false, function: i64 (%struct.mbedtls_mpi*)* @mbedtls_mpi_lsb, variables: !2)
!65 = !MDSubroutineType(types: !66)
!66 = !{!12, !40}
!67 = !MDSubprogram(name: "mbedtls_mpi_bitlen_0", scope: !1, file: !1, line: 380, type: !68, isLocal: false, isDefinition: true, scopeLine: 381, flags: DIFlagPrototyped, isOptimized: false, function: i64 (%struct.mbedtls_mpi*, i32)* @mbedtls_mpi_bitlen_0, variables: !2)
!68 = !MDSubroutineType(types: !69)
!69 = !{!12, !40, !18}
!70 = !MDSubprogram(name: "mbedtls_mpi_size", scope: !1, file: !1, line: 399, type: !65, isLocal: false, isDefinition: true, scopeLine: 400, flags: DIFlagPrototyped, isOptimized: false, function: i64 (%struct.mbedtls_mpi*)* @mbedtls_mpi_size, variables: !2)
!71 = !MDSubprogram(name: "mbedtls_mpi_read_string", scope: !1, file: !1, line: 424, type: !72, isLocal: false, isDefinition: true, scopeLine: 425, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.mbedtls_mpi*, i32, i8*)* @mbedtls_mpi_read_string, variables: !2)
!72 = !MDSubroutineType(types: !73)
!73 = !{!18, !23, !18, !74}
!74 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !MDDerivedType(tag: DW_TAG_const_type, baseType: !15)
!76 = !MDSubprogram(name: "mbedtls_mpi_write_string", scope: !1, file: !1, line: 523, type: !77, isLocal: false, isDefinition: true, scopeLine: 525, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.mbedtls_mpi*, i32, i8*, i64, i64*)* @mbedtls_mpi_write_string, variables: !2)
!77 = !MDSubroutineType(types: !78)
!78 = !{!18, !40, !18, !79, !12, !80}
!79 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!80 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!81 = !MDSubprogram(name: "mbedtls_mpi_read_file", scope: !1, file: !1, line: 600, type: !82, isLocal: false, isDefinition: true, scopeLine: 601, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.mbedtls_mpi*, i32, %struct.__sFILE*)* @mbedtls_mpi_read_file, variables: !2)
!82 = !MDSubroutineType(types: !83)
!83 = !{!18, !23, !18, !84}
!84 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !MDDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !86, line: 157, baseType: !87)
!86 = !MDFile(filename: "/usr/include/_stdio.h", directory: "/Users/ernestdefoy/Code/Research-2019/LLVM-Deps/projects/llvm-deps/mod_exp_tests/ct-verif-files/mbedtls2.9.0")
!87 = !MDCompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !86, line: 126, size: 1216, align: 64, elements: !88)
!88 = !{!89, !91, !92, !93, !95, !96, !101, !102, !103, !107, !111, !120, !124, !125, !128, !129, !133, !137, !138, !139}
!89 = !MDDerivedType(tag: DW_TAG_member, name: "_p", scope: !87, file: !86, line: 127, baseType: !90, size: 64, align: 64)
!90 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64, align: 64)
!91 = !MDDerivedType(tag: DW_TAG_member, name: "_r", scope: !87, file: !86, line: 128, baseType: !18, size: 32, align: 32, offset: 64)
!92 = !MDDerivedType(tag: DW_TAG_member, name: "_w", scope: !87, file: !86, line: 129, baseType: !18, size: 32, align: 32, offset: 96)
!93 = !MDDerivedType(tag: DW_TAG_member, name: "_flags", scope: !87, file: !86, line: 130, baseType: !94, size: 16, align: 16, offset: 128)
!94 = !MDBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!95 = !MDDerivedType(tag: DW_TAG_member, name: "_file", scope: !87, file: !86, line: 131, baseType: !94, size: 16, align: 16, offset: 144)
!96 = !MDDerivedType(tag: DW_TAG_member, name: "_bf", scope: !87, file: !86, line: 132, baseType: !97, size: 128, align: 64, offset: 192)
!97 = !MDCompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !86, line: 92, size: 128, align: 64, elements: !98)
!98 = !{!99, !100}
!99 = !MDDerivedType(tag: DW_TAG_member, name: "_base", scope: !97, file: !86, line: 93, baseType: !90, size: 64, align: 64)
!100 = !MDDerivedType(tag: DW_TAG_member, name: "_size", scope: !97, file: !86, line: 94, baseType: !18, size: 32, align: 32, offset: 64)
!101 = !MDDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !87, file: !86, line: 133, baseType: !18, size: 32, align: 32, offset: 320)
!102 = !MDDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !87, file: !86, line: 136, baseType: !4, size: 64, align: 64, offset: 384)
!103 = !MDDerivedType(tag: DW_TAG_member, name: "_close", scope: !87, file: !86, line: 137, baseType: !104, size: 64, align: 64, offset: 448)
!104 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64, align: 64)
!105 = !MDSubroutineType(types: !106)
!106 = !{!18, !4}
!107 = !MDDerivedType(tag: DW_TAG_member, name: "_read", scope: !87, file: !86, line: 138, baseType: !108, size: 64, align: 64, offset: 512)
!108 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !MDSubroutineType(types: !110)
!110 = !{!18, !4, !79, !18}
!111 = !MDDerivedType(tag: DW_TAG_member, name: "_seek", scope: !87, file: !86, line: 139, baseType: !112, size: 64, align: 64, offset: 576)
!112 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !MDSubroutineType(types: !114)
!114 = !{!115, !4, !115, !18}
!115 = !MDDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !86, line: 81, baseType: !116)
!116 = !MDDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !117, line: 71, baseType: !118)
!117 = !MDFile(filename: "/usr/include/sys/_types.h", directory: "/Users/ernestdefoy/Code/Research-2019/LLVM-Deps/projects/llvm-deps/mod_exp_tests/ct-verif-files/mbedtls2.9.0")
!118 = !MDDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !119, line: 46, baseType: !57)
!119 = !MDFile(filename: "/usr/include/i386/_types.h", directory: "/Users/ernestdefoy/Code/Research-2019/LLVM-Deps/projects/llvm-deps/mod_exp_tests/ct-verif-files/mbedtls2.9.0")
!120 = !MDDerivedType(tag: DW_TAG_member, name: "_write", scope: !87, file: !86, line: 140, baseType: !121, size: 64, align: 64, offset: 640)
!121 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !MDSubroutineType(types: !123)
!123 = !{!18, !4, !74, !18}
!124 = !MDDerivedType(tag: DW_TAG_member, name: "_ub", scope: !87, file: !86, line: 143, baseType: !97, size: 128, align: 64, offset: 704)
!125 = !MDDerivedType(tag: DW_TAG_member, name: "_extra", scope: !87, file: !86, line: 144, baseType: !126, size: 64, align: 64, offset: 832)
!126 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !MDCompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !86, line: 98, flags: DIFlagFwdDecl)
!128 = !MDDerivedType(tag: DW_TAG_member, name: "_ur", scope: !87, file: !86, line: 145, baseType: !18, size: 32, align: 32, offset: 896)
!129 = !MDDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !87, file: !86, line: 148, baseType: !130, size: 24, align: 8, offset: 928)
!130 = !MDCompositeType(tag: DW_TAG_array_type, baseType: !11, size: 24, align: 8, elements: !131)
!131 = !{!132}
!132 = !MDSubrange(count: 3)
!133 = !MDDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !87, file: !86, line: 149, baseType: !134, size: 8, align: 8, offset: 952)
!134 = !MDCompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8, align: 8, elements: !135)
!135 = !{!136}
!136 = !MDSubrange(count: 1)
!137 = !MDDerivedType(tag: DW_TAG_member, name: "_lb", scope: !87, file: !86, line: 152, baseType: !97, size: 128, align: 64, offset: 960)
!138 = !MDDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !87, file: !86, line: 155, baseType: !18, size: 32, align: 32, offset: 1088)
!139 = !MDDerivedType(tag: DW_TAG_member, name: "_offset", scope: !87, file: !86, line: 156, baseType: !115, size: 64, align: 64, offset: 1152)
!140 = !MDSubprogram(name: "mbedtls_mpi_write_file", scope: !1, file: !1, line: 633, type: !141, isLocal: false, isDefinition: true, scopeLine: 634, flags: DIFlagPrototyped, isOptimized: false, function: i32 (i8*, %struct.mbedtls_mpi*, i32, %struct.__sFILE*)* @mbedtls_mpi_write_file, variables: !2)
!141 = !MDSubroutineType(types: !142)
!142 = !{!18, !74, !40, !18, !84}
!143 = !MDSubprogram(name: "mbedtls_mpi_read_binary", scope: !1, file: !1, line: 672, type: !144, isLocal: false, isDefinition: true, scopeLine: 673, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.mbedtls_mpi*, i8*, i64)* @mbedtls_mpi_read_binary, variables: !2)
!144 = !MDSubroutineType(types: !145)
!145 = !{!18, !23, !146, !12}
!146 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64, align: 64)
!147 = !MDDerivedType(tag: DW_TAG_const_type, baseType: !11)
!148 = !MDSubprogram(name: "mbedtls_mpi_write_binary", scope: !1, file: !1, line: 695, type: !149, isLocal: false, isDefinition: true, scopeLine: 696, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.mbedtls_mpi*, i8*, i64)* @mbedtls_mpi_write_binary, variables: !2)
!149 = !MDSubroutineType(types: !150)
!150 = !{!18, !40, !90, !12}
!151 = !MDSubprogram(name: "mbedtls_mpi_shift_l_0", scope: !1, file: !1, line: 715, type: !32, isLocal: false, isDefinition: true, scopeLine: 716, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.mbedtls_mpi*, i64, i32, i64*)* @mbedtls_mpi_shift_l_0, variables: !2)
!152 = !MDSubprogram(name: "mbedtls_mpi_shift_r", scope: !1, file: !1, line: 765, type: !35, isLocal: false, isDefinition: true, scopeLine: 766, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.mbedtls_mpi*, i64)* @mbedtls_mpi_shift_r, variables: !2)
!153 = !MDSubprogram(name: "mbedtls_mpi_cmp_abs_0", scope: !1, file: !1, line: 808, type: !154, isLocal: false, isDefinition: true, scopeLine: 809, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.mbedtls_mpi*, %struct.mbedtls_mpi*, i32)* @mbedtls_mpi_cmp_abs_0, variables: !2)
!154 = !MDSubroutineType(types: !155)
!155 = !{!18, !40, !40, !18}
!156 = !MDSubprogram(name: "mbedtls_mpi_cmp_mpi_0", scope: !1, file: !1, line: 838, type: !154, isLocal: false, isDefinition: true, scopeLine: 839, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.mbedtls_mpi*, %struct.mbedtls_mpi*, i32)* @mbedtls_mpi_cmp_mpi_0, variables: !2)
!157 = !MDSubprogram(name: "mbedtls_mpi_cmp_int_0", scope: !1, file: !1, line: 871, type: !158, isLocal: false, isDefinition: true, scopeLine: 872, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.mbedtls_mpi*, i64, i32)* @mbedtls_mpi_cmp_int_0, variables: !2)
!158 = !MDSubroutineType(types: !159)
!159 = !{!18, !40, !54, !18}
!160 = !MDSubprogram(name: "mbedtls_mpi_add_abs", scope: !1, file: !1, line: 887, type: !161, isLocal: false, isDefinition: true, scopeLine: 888, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.mbedtls_mpi*, %struct.mbedtls_mpi*, %struct.mbedtls_mpi*)* @mbedtls_mpi_add_abs, variables: !2)
!161 = !MDSubroutineType(types: !162)
!162 = !{!18, !23, !40, !40}
!163 = !MDSubprogram(name: "mbedtls_mpi_sub_abs", scope: !1, file: !1, line: 964, type: !161, isLocal: false, isDefinition: true, scopeLine: 965, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.mbedtls_mpi*, %struct.mbedtls_mpi*, %struct.mbedtls_mpi*)* @mbedtls_mpi_sub_abs, variables: !2)
!164 = !MDSubprogram(name: "mbedtls_mpi_add_mpi", scope: !1, file: !1, line: 1007, type: !161, isLocal: false, isDefinition: true, scopeLine: 1008, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.mbedtls_mpi*, %struct.mbedtls_mpi*, %struct.mbedtls_mpi*)* @mbedtls_mpi_add_mpi, variables: !2)
