; ModuleID = '<stdin>'
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.14.0"

%struct.bignum_st = type { i64*, i32, i32, i32, i32 }
%struct.bignum_ctx = type opaque
%struct.bn_mont_ctx_st = type { i32, %struct.bignum_st, %struct.bignum_st, %struct.bignum_st, [2 x i64], i32 }

@dummy = global i32 0, align 4
@.str = private unnamed_addr constant [14 x i8] c"./v2_4_mont.c\00", align 1

; Function Attrs: nounwind ssp uwtable
define i32 @BN_exp(%struct.bignum_st* %r, %struct.bignum_st* %a, %struct.bignum_st* %p, %struct.bignum_ctx* %ctx) #0 {
entry:
  call void @llvm.dbg.value(metadata %struct.bignum_st* %r, i64 0, metadata !54, metadata !55), !dbg !56
  call void @llvm.dbg.value(metadata %struct.bignum_st* %a, i64 0, metadata !57, metadata !55), !dbg !58
  call void @llvm.dbg.value(metadata %struct.bignum_st* %p, i64 0, metadata !59, metadata !55), !dbg !60
  call void @llvm.dbg.value(metadata %struct.bignum_ctx* %ctx, i64 0, metadata !61, metadata !55), !dbg !62
  call void @llvm.dbg.value(metadata i32 0, i64 0, metadata !63, metadata !55), !dbg !64
  %call = call i32 @BN_get_flags(%struct.bignum_st* %p, i32 4), !dbg !65
  %cmp = icmp ne i32 %call, 0, !dbg !67
  br i1 %cmp, label %if.then, label %lor.lhs.false, !dbg !68

lor.lhs.false:                                    ; preds = %entry
  %call1 = call i32 @BN_get_flags(%struct.bignum_st* %a, i32 4), !dbg !69
  %cmp2 = icmp ne i32 %call1, 0, !dbg !70

!0 = !MDCompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.7.0 (trunk) (git@git.psu.edu:dbz5017/LLVM-Deps.git dfce73fe0831457cbc5c1a8f7788dfcbd809ad99)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !6, globals: !48, imports: !2)
!1 = !MDFile(filename: "v2_4_mont.c", directory: "/Users/ernestdefoy/Code/Research-2019/LLVM-Deps/projects/llvm-deps/mod_exp_tests/ct-verif-files/openSSL_1_1_0g")
!2 = !{}
!3 = !{!4, !5}
!4 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!5 = !MDBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!6 = !{!7, !29, !32}
!7 = !MDSubprogram(name: "BN_exp", scope: !8, file: !8, line: 41, type: !9, isLocal: false, isDefinition: true, scopeLine: 42, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.bignum_st*, %struct.bignum_st*, %struct.bignum_st*, %struct.bignum_ctx*)* @BN_exp, variables: !2)
!8 = !MDFile(filename: "./v2_4_mont.c", directory: "/Users/ernestdefoy/Code/Research-2019/LLVM-Deps/projects/llvm-deps/mod_exp_tests/ct-verif-files/openSSL_1_1_0g")
!9 = !MDSubroutineType(types: !10)
!10 = !{!11, !12, !24, !24, !26}
!11 = !MDBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!12 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!13 = !MDDerivedType(tag: DW_TAG_typedef, name: "BIGNUM", file: !14, line: 80, baseType: !15)
!14 = !MDFile(filename: "v4_3_2_include/openssl/ossl_typ.h", directory: "/Users/ernestdefoy/Code/Research-2019/LLVM-Deps/projects/llvm-deps/mod_exp_tests/ct-verif-files/openSSL_1_1_0g")
!15 = !MDCompositeType(tag: DW_TAG_structure_type, name: "bignum_st", file: !16, line: 218, size: 192, align: 64, elements: !17)
!16 = !MDFile(filename: "v4_3_2_include/bn_lcl.h", directory: "/Users/ernestdefoy/Code/Research-2019/LLVM-Deps/projects/llvm-deps/mod_exp_tests/ct-verif-files/openSSL_1_1_0g")
!17 = !{!18, !20, !21, !22, !23}
!18 = !MDDerivedType(tag: DW_TAG_member, name: "d", scope: !15, file: !16, line: 219, baseType: !19, size: 64, align: 64)
!19 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!20 = !MDDerivedType(tag: DW_TAG_member, name: "top", scope: !15, file: !16, line: 221, baseType: !11, size: 32, align: 32, offset: 64)
!21 = !MDDerivedType(tag: DW_TAG_member, name: "dmax", scope: !15, file: !16, line: 223, baseType: !11, size: 32, align: 32, offset: 96)
!22 = !MDDerivedType(tag: DW_TAG_member, name: "neg", scope: !15, file: !16, line: 224, baseType: !11, size: 32, align: 32, offset: 128)
!23 = !MDDerivedType(tag: DW_TAG_member, name: "flags", scope: !15, file: !16, line: 225, baseType: !11, size: 32, align: 32, offset: 160)
!24 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !MDDerivedType(tag: DW_TAG_const_type, baseType: !13)
!26 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !MDDerivedType(tag: DW_TAG_typedef, name: "BN_CTX", file: !14, line: 81, baseType: !28)
!28 = !MDCompositeType(tag: DW_TAG_structure_type, name: "bignum_ctx", file: !14, line: 81, flags: DIFlagFwdDecl)
!29 = !MDSubprogram(name: "BN_mod_exp", scope: !8, file: !8, line: 92, type: !30, isLocal: false, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.bignum_st*, %struct.bignum_st*, %struct.bignum_st*, %struct.bignum_st*, %struct.bignum_ctx*)* @BN_mod_exp, variables: !2)
!30 = !MDSubroutineType(types: !31)
!31 = !{!11, !12, !24, !24, !24, !26}
!32 = !MDSubprogram(name: "BN_mod_exp_mont_algorithm", scope: !8, file: !8, line: 306, type: !33, isLocal: false, isDefinition: true, scopeLine: 308, flags: DIFlagPrototyped, isOptimized: false, function: i32 (%struct.bignum_st*, %struct.bignum_st*, %struct.bignum_st*, %struct.bignum_st*, %struct.bignum_ctx*, %struct.bn_mont_ctx_st*, %struct.bignum_st*, %struct.bignum_st*, %struct.bignum_st*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32)* @BN_mod_exp_mont_algorithm, variables: !2)
!33 = !MDSubroutineType(types: !34)
!34 = !{!11, !12, !24, !24, !24, !26, !35, !12, !12, !12, !11, !11, !11, !11, !11, !11, !11, !11, !11, !11, !11, !11, !11, !11, !11, !11, !11, !11, !11, !11, !11, !11, !11, !11, !11, !11, !11, !11, !11, !11, !11, !11, !11, !11, !11, !11, !11}
!35 = !MDDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64, align: 64)
!36 = !MDDerivedType(tag: DW_TAG_typedef, name: "BN_MONT_CTX", file: !14, line: 83, baseType: !37)
!37 = !MDCompositeType(tag: DW_TAG_structure_type, name: "bn_mont_ctx_st", file: !16, line: 229, size: 832, align: 64, elements: !38)
!38 = !{!39, !40, !41, !42, !43, !47}
!39 = !MDDerivedType(tag: DW_TAG_member, name: "ri", scope: !37, file: !16, line: 230, baseType: !11, size: 32, align: 32)
!40 = !MDDerivedType(tag: DW_TAG_member, name: "RR", scope: !37, file: !16, line: 231, baseType: !13, size: 192, align: 64, offset: 64)
!41 = !MDDerivedType(tag: DW_TAG_member, name: "N", scope: !37, file: !16, line: 232, baseType: !13, size: 192, align: 64, offset: 256)
!42 = !MDDerivedType(tag: DW_TAG_member, name: "Ni", scope: !37, file: !16, line: 233, baseType: !13, size: 192, align: 64, offset: 448)
!43 = !MDDerivedType(tag: DW_TAG_member, name: "n0", scope: !37, file: !16, line: 235, baseType: !44, size: 128, align: 64, offset: 640)
!44 = !MDCompositeType(tag: DW_TAG_array_type, baseType: !5, size: 128, align: 64, elements: !45)
!45 = !{!46}
!46 = !MDSubrange(count: 2)
!47 = !MDDerivedType(tag: DW_TAG_member, name: "flags", scope: !37, file: !16, line: 238, baseType: !11, size: 32, align: 32, offset: 768)
!48 = !{!49}
!49 = !MDGlobalVariable(name: "dummy", scope: !0, file: !8, line: 13, type: !11, isLocal: false, isDefinition: true, variable: i32* @dummy)
!50 = !{i32 2, !"Dwarf Version", i32 2}
!51 = !{i32 2, !"Debug Info Version", i32 3}
!52 = !{i32 1, !"PIC Level", i32 2}
!53 = !{!"clang version 3.7.0 (trunk) (git@git.psu.edu:dbz5017/LLVM-Deps.git dfce73fe0831457cbc5c1a8f7788dfcbd809ad99)"}
!54 = !MDLocalVariable(tag: DW_TAG_arg_variable, name: "r", arg: 1, scope: !7, file: !8, line: 41, type: !12)
!55 = !MDExpression()
!56 = !MDLocation(line: 41, column: 20, scope: !7)
!57 = !MDLocalVariable(tag: DW_TAG_arg_variable, name: "a", arg: 2, scope: !7, file: !8, line: 41, type: !24)
!58 = !MDLocation(line: 41, column: 37, scope: !7)
!59 = !MDLocalVariable(tag: DW_TAG_arg_variable, name: "p", arg: 3, scope: !7, file: !8, line: 41, type: !24)
!60 = !MDLocation(line: 41, column: 54, scope: !7)
!61 = !MDLocalVariable(tag: DW_TAG_arg_variable, name: "ctx", arg: 4, scope: !7, file: !8, line: 41, type: !26)
!62 = !MDLocation(line: 41, column: 65, scope: !7)
!63 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "ret", scope: !7, file: !8, line: 43, type: !11)
!64 = !MDLocation(line: 43, column: 18, scope: !7)
!65 = !MDLocation(line: 46, column: 9, scope: !66)
!66 = distinct !MDLexicalBlock(scope: !7, file: !8, line: 46, column: 9)
!67 = !MDLocation(line: 46, column: 43, scope: !66)
!68 = !MDLocation(line: 47, column: 13, scope: !66)
!69 = !MDLocation(line: 47, column: 16, scope: !66)
!70 = !MDLocation(line: 47, column: 50, scope: !66)
!71 = !MDLocation(line: 46, column: 9, scope: !7)
!72 = !MDLocation(line: 49, column: 9, scope: !73)
!73 = distinct !MDLexicalBlock(scope: !66, file: !8, line: 47, column: 56)
!74 = !MDLocation(line: 51, column: 5, scope: !73)
!75 = !MDLocation(line: 53, column: 5, scope: !7)
!76 = !MDLocation(line: 54, column: 12, scope: !77)
!77 = distinct !MDLexicalBlock(scope: !7, file: !8, line: 54, column: 9)
!78 = !MDLocation(line: 54, column: 18, scope: !77)
!79 = !MDLocation(line: 54, column: 24, scope: !77)
!80 = !MDLocation(line: 54, column: 9, scope: !7)
!81 = !MDLocation(line: 55, column: 14, scope: !77)
!82 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "rr", scope: !7, file: !8, line: 44, type: !12)
!83 = !MDLocation(line: 44, column: 17, scope: !7)
!84 = !MDLocation(line: 55, column: 9, scope: !77)
!85 = !MDLocation(line: 58, column: 9, scope: !7)
!86 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !7, file: !8, line: 44, type: !12)
!87 = !MDLocation(line: 44, column: 13, scope: !7)
!88 = !MDLocation(line: 59, column: 12, scope: !89)
!89 = distinct !MDLexicalBlock(scope: !7, file: !8, line: 59, column: 9)
!90 = !MDLocation(line: 59, column: 20, scope: !89)
!91 = !MDLocation(line: 59, column: 25, scope: !89)
!92 = !MDLocation(line: 59, column: 9, scope: !7)
!93 = !MDLocation(line: 60, column: 9, scope: !89)
!94 = !MDLocation(line: 62, column: 9, scope: !95)
!95 = distinct !MDLexicalBlock(scope: !7, file: !8, line: 62, column: 9)
!96 = !MDLocation(line: 62, column: 23, scope: !95)
!97 = !MDLocation(line: 62, column: 9, scope: !7)
!98 = !MDLocation(line: 63, column: 9, scope: !95)
!99 = !MDLocation(line: 64, column: 12, scope: !7)
!100 = !MDLocalVariable(tag: DW_TAG_auto_variable, name: "bits", scope: !7, file: !8, line: 43, type: !11)
!101 = !MDLocation(line: 43, column: 12, scope: !7)
!102 = !MDLocation(line: 66, column: 9, scope: !103)
!103 = distinct !MDLexicalBlock(scope: !7, file: !8, line: 66, column: 9)
!104 = !MDLocation(line: 66, column: 9, scope: !7)
!105 = !MDLocation(line: 67, column: 13, scope: !106)
!106 = distinct !MDLexicalBlock(scope: !107, file: !8, line: 67, column: 13)
!107 = distinct !MDLexicalBlock(scope: !103, file: !8, line: 66, column: 23)
!108 = !MDLocation(line: 67, column: 28, scope: !106)
!109 = !MDLocation(line: 67, column: 13, scope: !107)
